Revit 2026 API

# SpaceSpaceType Property

---

Get or set the Space type of the Space.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public SpaceType SpaceType { get; set; }
```
```vb
Public Property SpaceType As SpaceType
	Get
	Set
```
```cpp
public:
property SpaceType SpaceType {
	SpaceType get ();
	void set (SpaceType value);
}
```
```fsharp
member SpaceType : SpaceType with get, set
```

#### Property Value

SpaceType

This property is used to get or set the Space type of the Space.

#### Reference

Space Class

Autodesk.Revit.DB.Mechanical Namespace